app/controllers/participants_controller.rb

    def create
        names = participant_params[:name].split("\r\n")

        names.each { |name| Participant.create!(name: name) }
---
SELECT "participants".* FROM "participants"
INSERT INTO "participants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Listy"], ["created_at", "2019-08-16 04:48:31.604535"], ["updated_at", "2019-08-16 04:48:31.604535"]]

    def index
        @participants = Participant.all
---
SELECT "participants".* FROM "participants"