app/models/participant.rb

    def self.group_generator
        participants = Participant.pluck(:name)
---
SELECT "participants"."name" FROM "participants"

    def self.group_builder
        num_participants = Participant.count
---
SELECT COUNT(*) FROM "participants"